app/views/recipes/_recipe_form.html.erb

    <%= f.label :user_id, 'Created by:' %>
    <%= f.select :user_id, User.all.collect { |user| [ user.name, user.id ] } %>
    <h4>Check all ingredients that apply:</h4>
        <% Ingredient.all.each do |ingredient| %>
---
SELECT "users".* FROM "users"
SELECT "ingredients".* FROM "ingredients"