app/views/recipes/index.html.erb

SELECT COUNT(*) FROM "ingredients" INNER JOIN "ris" ON "ingredients"."id" = "ris"."ingredient_id" WHERE "ris"."recipe_id" = ?  [["recipe_id", 9]]
---

 <!-- <%=recipe.ingredients.count%> -->