app/views/users/_user_form.html.erb

SELECT "ingredients".* FROM "ingredients"
---
<h4>Check all allergies that apply:</h4>
    <% Ingredient.all.each do |ingredient| %>