app/views/users/show.html.erb

SELECT "allergies".* FROM "allergies" WHERE "allergies"."user_id" = ?  [["user_id", 15]]
---
<ul>
<%@user.allergies.each do |allergy|%>

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 15]]
---
<ul>
<%@user.recipes.each do |recipe|%>