app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients" LEFT OUTER JOIN "allergies" ON "allergies"."ingredient_id" = "ingredients"."id" GROUP BY "user_id" ORDER BY COUNT(ingredient_id) DESC
---
    def index
        # @ingredients = Ingredient.joins(:allergies).merge(Allergy.order(priority: :desc))

        @ingredients = Ingredient.left_joins(:allergies).group(:ingredient_id).order('COUNT(user_id) DESC')

INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Pepper"], ["created_at", "2020-05-20 18:29:40.246927"], ["updated_at", "2020-05-20 18:29:40.246927"]]
---
    def create
        @ingredient = Ingredient.create(ingredient_params)

UPDATE "ingredients" SET "name" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["name", "Eggs"], ["updated_at", "2020-05-20 18:29:30.444978"], ["id", 1]]
---
    def update
        @ingredient.update(ingredient_params)

DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 1]]
---
    def destroy
        @ingredient.destroy

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_ingredient
        @ingredient = Ingredient.find(params[:id])