app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" LEFT OUTER JOIN "ris" ON "ris"."recipe_id" = "recipes"."id" GROUP BY "recipe_id" ORDER BY COUNT(ingredient_id) DESC
---
    def index
        # @recipes = Recipe.all
        @recipes = Recipe.left_joins(:ris).group(:recipe_id).order('COUNT(ingredient_id) DESC')