app/controllers/recipes_controller.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_ingredient
        @ingredient = Ingredient.find(params[:id])