app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Egg Jelly Scramble"], ["user_id", 7], ["created_at", "2020-05-20 20:25:24.854847"], ["updated_at", "2020-05-20 20:25:24.854847"]]
---
    def create
        @recipe = Recipe.create(recipe_params)