app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Abhinav"], ["created_at", "2020-05-20 19:32:40.035526"], ["updated_at", "2020-05-20 19:32:40.035526"]]
---
    def create
        @user =User.create(user_params)